Repository: Mikesoon7/language
Catalog: Language/*.lproj/Localizable.strings
Languages: uk

# tabBarDictionaries
source: Dictionaries
uk: Словники

# tabBarSearch
source: Search
uk: Пошук

# tabBarSettings
source: Settings
uk: Налаштування

# menuVCTitle
source: Dictionaries
uk: Словники

# menu.deleteDictionary
source: Delete dictionary?
uk: Видалити словник?

# tableCellName
source: Name
uk: Імʼя

# tableCellNumberOfCards
source: Total cards
uk: Всього карток

# tableCellImport
source: Import new dictionary
uk: Додади словник

# statisticCellNumberOfUse
source: Accessed
uk: Відкривався

# statisticCellCreationDate
source: Since
uk: Створен

# statistic.title
source: Dictionaries statistic
uk: Статистика словників

# statistic.beginDate
source: Begin date:
uk: Початок:

# statistic.endDate
source: End date:
uk: Кінець:

# statistic.currentWeek
source: Current week
uk: Поточний тиждень

# statistic.currentMonth
source: Current month
uk: Поточний місяць

# statistic.previousMonth
source: Previous month
uk: Попередній місяць

# statistic.allTime
source: All time
uk: За весь час

# statistic.custom
source: Custom
uk: Обрати свій

# settingsVCTitle
source: Settings
uk: Налаштування

# generalSection
source: General
uk: Основні

# searchSection
source: Search
uk: Пошук

# dictionarySection
source: Dictionary
uk: Словники

# languageItem
source: Language
uk: Мова

# themeItem
source: Theme
uk: Тема

# darkTheme
source: Dark
uk: Темна

# lightTheme
source: Light
uk: Світла

# systemTheme
source: System
uk: Системна

# notificationItem
source: Notifications
uk: Повідомлення

# searchBarPositionItem
source: Search bar position
uk: Розташування пошуку

source: Top
uk: Зверху

source: Bottom
uk: Знизу

source: Dictionaries
uk: Словники

# separatorItem
source: Symbols for pairs dividing
uk: Символи для поділу

# duplicatesItem
source: Duplicates
uk: Дублікати

source: Keep
uk: Залишати

source: Remove
uk: Видаляти

# propositionForSign
source: Connect your Apple ID to pass your data beteen devices and store it in the iCloud
uk: Підключити ваш Apple ID для передачі даних між пристроями та збереження у iCloud

# addDictTitle
source: Dictionary creation
uk: Створення

# addWordTitle
source: Text Uploading
uk: Додавання

# viewPlaceholderWord
source: Word
uk: Слово

# viewPlaceholderMeaning
source: description
uk: опис

# fieldPlaceholder
source: Name
uk: Имʼя

source: Dictionary name
uk: Назва словника

# system.cancel
source: Cancel
uk: Cкасувати

# system.agreeFormal
source: Understand
uk: Зрозумiло

# system.agreeInformal
source: Okey
uk: Добре

# system.save
source: Save
uk: Зберегти

# system.create
source: Create
uk: Створити

# system.great
source: Great
uk: Чудово

# system.edit
source: Edit
uk: Редагувати

# system.delete
source: Delete
uk: Видалити

# system.done
source: Done
uk: Готово

# system.yes
source: Yes
uk: Так

# system.no
source: No
uk: Ні

# system.settings
source: Settings
uk: Налаштування

# system.newLine
source: New line
uk: З нового радка

# system.next
source: Next
uk: Далі

# system.letsGo
source: Let's go
uk: Поіхали

# system.skip
source: Skip
uk: Пропустити

# textAlert
source: Enter the text
uk: Вкажіть текст

# nameAlert
source: Enter the name
uk: Вкажіть назву

# textInfo
source: Please, enter at least 1 pair of words.
uk: Будь ласка, не залишайте поля з текстом порожнім.

# nameInfo
source: Almost done. Please, name your dictionary
uk: Майже закінчили. Залишилось задати назву.

# detailsTitle
source: Details
uk: Подробиці

# randomize
source: Randomize cards
uk: У перемішку

# goal
source: Set the goal
uk: Встановити ціль

# addWords
source: Add new words
uk: Додати слів

source: Start
uk: Почати

# gameTitle
source: Cards
uk: Картки

# gameDetails.information
source: Tap on any word to uncover its meaning using the built-in iOS dictionary. You can also edit or delete your card if necessary. This is your personalized learning space - make the most out of it.
uk: Торкніться будь-якого слова, щоб дізнатися його значення з вбудованого словника iOS. За потреби, ви можете відредагувати або видалити свою картку прямо тут. Це ваш особистий простір для навчання - використовуйте його можливості для кращого засвоєння інформації.

# gameDetails.suggestion1Part
source: If you encounter any issues with accessing dictionaries, you may need to download or update them. To do so, navigate to
uk: Якщо у вас виникнуть проблеми з доступом до словників, можливо, вам потрібно їх завантажити або оновити. Для цього перейдіть в

# gameDetails.suggestion2Part
source: on your device and ensure the required dictionaries are installed.
uk: на вашому пристрої та переконайтеся, що потрібні словники встановлені.

# gameDetails.settingsPath
source: Settings -> General -> Dictionaries
uk: Налаштування -> Основні -> Словники

# gameDetails.deleteAlert.title
source: Delete current card
uk: Видалити поточну пару

# gameDetails.deleteAlert.message
source: Are you sure you want to delete this pair?
uk: Ви впевнені, що хочете видалити цю пару?

# gameDetails.deleteAlert.message.warning
source: This is the last card, so your dictionary will also be deleted.
uk: Це остання картка, тому ваш словник також буде видалено.

# gameDetails.emptyTextAlert.title
source: Text can not me empty.
uk: Текст не может быть пустым.

# gameDetails.emptyTextAlert.message
source: Saveing empty values will cause deleting current card?
uk: Сохранение пустого значения приведет к удалению карточки.

# notification.allowNotification
source: Allow notification
uk: Дозволити повідомлення

source: Frequency
uk: Нагадувати

# chooseTime
source: Time
uk: Час

source: Every day
uk: Кожен день

source: Once a week
uk: Раз на тиждень

# onWeekdays
source: On the weekday
uk: У будні

source: On the weekend
uk: На вихідних

source: Custom
uk: Обрати свій

# notification.notificationTitle
source: Memory Check-In Time
uk: 5 хвилин щоденно - 2,5 години за місяць

# notification.notificationMessage
source: Hey there! Remember those important things you wanted to master? Your flashcards are waiting for a quick review. Swipe now to stay sharp!
uk: Невелике нагадування про ваші картки. Витративши лише 5 хвилин щоденно, ви можете покращити пам'ять та знання. Бажаємо успіхів у вивченні!

# notification.alertTitle
source: Enable Notifications to stay connected
uk: Увімкніть сповіщення, щоб бути в курсі

# notification.alertMessage
source: We understand your concerns, and we won't overwhelm you with notifications. We'll send only one message per day to keep you updated and remind you about us. You can always change your preferences in the settings
uk: Знаємо, що час цінний, тому надсилатимемо лише одне повідомлення в день. Це ваш нагадувач про можливість практикувати та вдосконалювати знання з допомогою наших карток. Завжди можна змінити налаштування в додатку

# searchVCTitle
source: Search
uk: Пошук

# yourWord
source: Insert your text
uk: Введіть текст

# separators.addChar
source: Add character
uk: Додати знак

# separators.placeholder
source: Text
uk: Текст

# separators.alertErrorTitle
source: Invalid input
uk: Некоректний ввід

# separators.alertTitle
source: Type from 1 to 3 characters
uk: Введіть від 1 до 3 символів

# separators.alertDuplicateMessage
source: Please, don't use duplicates
uk: Будь ласка, не використовуйте дублікати

# separators.alertSpaceMessage
source: Please, don't use spaces only
uk: Будь ласка, не використовуйте лише пробіли

# separators.title
source: Text Division and Separators
uk: Як це працюе ?

# separators.infoFirstPart
source: First, the provided text is broken into chunks, using a new line to signal the beginning of a new chunk. You can transition to a new line without breaking the current block by using the "New line" button at the top of the keyboard.
uk: По-перше, введений текст поділяється на блоки, використовуючи абзац як роздільник.

# separators.infoSecondPart
source: With these defined blocks, the app uses the provided separator symbol to create a pair within each block.
uk: По-друге, блоки поділяються за допомогою вибраного символу на пари Слово та Визначення.

# separators.infoFinalPart
source: Applying a new separator won't affect existing dictionaries. If a text block contains multiple special symbols, only the first one is counted as the separator.
uk: Якщо у вас виникнули запитання чи пропозиції - будь ласка, зв'яжіться з нами.

# edit.searchPlaceholder
source: You text...
uk: Ваш текст...

# tutorial.firstViewLabel.title
source: Hello! We're thrilled to have you onboard with Learny
uk: Вітаємо у Learny!

# tutorial.firstViewLabel
source: Learny simplifies your study by organizing information into repeatable chunks. The app uses a few rules to split your text and create cards for each block. Just a quick recap and you are ready to go!
uk: Learny допоможе вам організувати інформацію у зручні блоки для легшого повторення. За допомогою кількох правил, додаток розділяє ваш текст і створює картку для кожного блоку. Давайте розглянемо можливості цього додатка!

# tutorial.secondViewLabel
source: On your main screen, you can access your existing dictionaries, as well as check statistics, edit, or delete them with the swipe.
uk: На головному екрані ви можете переглядати ваши словники, а також перевіряти статистику, редагувати або видаляти їх за допомогою свайпа.

# tutorial.thirdViewLabel
source: Of course, you can also add a new one by typing its content and name. Excited yet? Let's create your first dictionary!
uk: Додавання нового словника просте: введіть його зміст та назву. Цікаво? Давайте створимо перший словник!

# tutorial.fourthViewLabel
source: We're almost done! Just a few words about text division: New lines serve as breaking points for text chunks. If you don't want to break a sequence, use the "New line" button at the top of the keyboard.
uk: Майже готово! Трохи про розділення тексту: кожен новий рядок розділяє блоки тексту. Якщо не хочете розділяти блок, використовуйте кнопку "З нового рядка" вгорі клавіатури.

# tutorial.fifthViewLabel
source: For specific pairings, like a word and its definition, use the separator symbol. It can be set in settings. Current separator will always display as a hint before editing.
uk: Для специфічного розділення, як наприклад слово та його визначення, користуйтеся розділювачем. Його можна змінити в налаштуваннях. Поточний розділювач завжди відображається у підказці перед редагуванням.

# tutorial.sixthViewLabel
source: That's it! We're grateful for the chance to assist you in achieving your goals. Wish you entertaining learning prossess. Good luck!
uk: От і все! Ми вдячні за можливість допомогти вам досягти ваших мет. Бажаємо успіху та приємного використання!
